Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.RemoveLeg Method
 Removes a polygon section which is the end section, from this ConnectiveGeometry including extensions and cylindrical surface.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry RemoveLeg(
	ConnectiveGeometry geometry,
	GeometrySection legSection
)
Public Function RemoveLeg (
	geometry As ConnectiveGeometry,
	legSection As GeometrySection
) As ConnectiveGeometry
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
ConnectiveGeometry used to remove a connection.
legSection
Type: Tekla.Structures.Model.GeometrySection
Leg GeometrySection to remove.
Return Value
Type: ConnectiveGeometry
Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Exceptions
Exception | Condition
ArgumentException | Thrown when the supplied legSection is invalid leg section or geometry is a stand-alone bend geometry, meaning that the first GeometrySection is a BendSurfaceNode.
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace